other/PPMH/1-1 MOOC overview.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 1-1 MOOC overview
#+begin_verse
Welcome to the Positive Psychiatry online course
	created by the Education Department at the Brain and Mind Center, University of Sydney.
We are a team of three psychiatrists
	who are passionate about community education as a means of empowerment.
That is Associate Professor Louise Nash, Associate Professor Loyola McLean, and myself.
We have brought together a large number of Australia's leading experts
		from psychiatry, psychology, and mental health research,
	to share their ideas.
We'll also hear from experts by experience - people
	who have lived with mental illness and share their stories of personal recovery.
	
Good mental health is about feeling good and functioning well.
And positive psychiatry is about building strength as well as fixing problems.
The course will also cover the fundamentals of mental illness
	and practical strategies for staying strong and enhancing well-being.
The course is organized into five modules, each designed to be covered in one week.

In the first module, we meet Tina,
	a lived experience and recovery expert who tells the first part of her story.
This module will cover positive mental health, stress, and resilience,
	and some of the important findings from Aristotle
		through to recent research on the correlates of happiness.
		
The second module is about the body and mind.
We will learn about the central importance of physical health and lifestyle,
	and how exercise can be used as an evidence-based treatment for common mental health conditions.
We will cover basic relaxation and mindfulness strategies,
	as well as personality strengths and how to identify your own strengths.
	
In the third module we talk about love and work,
	and introduce the complementary ideas of rest and play.
We will hear about attachment theory, social connections,
	and the ancient wisdom of Australian Aboriginal views on well-being.
We discuss the importance of contributing,
	and here you will find out whether or not work is good for you.
	
In the fourth module, we cover the major categories of mental illness;
	their symptoms, causes, and treatments.
This includes the more common conditions such as anxiety, depression, and addictions,
	as well as less common mental illness such as psychosis, schizophrenia, and bipolar disorder.
	
Our fifth and final module in this course will detail some of the many paths to recovery.
From early intervention through the philosophy of personal recovery, consumer support networks,
	creative arts as therapy, as well as spiritual and religious practices.
	
Within each module there will be many lectures and links to recommended readings.
There will be self-assessment questionnaires
	and practical homework tasks including SMART goal setting.
Assessments include quizzes and peer marked short answer questions.

So join us for the next five weeks on a shared journey of learning towards better mental health
	and better understanding of this fundamental aspect of our well-being.
#+end_verse
** expression
psychiatry [sɪˈkaɪətri] psychiatrist: n.n.the study and treatment of mental illnesses ⇨ psychology精神病学
brain [breɪn]: n. the organ inside your head that controls how you think, feel, and move脑
associate [əˈsoʊʃiət]: n. someone who you work or do business with SYN colleague合作人
strength [streŋθ]: n. the physical power and energy that makes someone strong OPP weakness优势
lifestyle [ˈlaɪfˌstaɪl]: n. the way a person or group of people live, including the place they live in, the things they own, the kind of job they do, and the activities they enjoy生活方式
mindfulness : n. 正念
complementary [ˌkɑmpləˈment(ə)ri]: adj. complementary things go well together, although they are usually different补充的, 补足的
category [ˈkætəɡəri]: n. a group of people or things that are all of the same type种类
anxiety [æŋˈzaɪəti]: n. the feeling of being very worried about something SYN concern焦虑
depression [dɪˈpreʃ(ə)n]: n. a medical condition that makes you very unhappy and anxious and often prevents you from living a normal life抑郁
psychosis [saɪˈkoʊsɪs]: n. a serious mental illness that can change your character and make you unable to behave in a normal way ⇨ psychotic精神错乱
schizophrenia [ˌskɪtsəˈfriniə]: n. a serious mental illness in which someone’s thoughts and feelings are not based on what is really happening around them[心]精神分裂症
bipolar [ˌbaɪˈpoʊlər]: adj. bipolar disorder technical ↑manic depression狂躁的
intervention [ˌɪntərˈvenʃ(ə)n]: n. the act of becoming involved in an argument, fight, or other difficult situation in order to change what happens干涉
quiz [kwɪz]: n. a competition or game in which people have to answer questions测验
peer [pɪr]: n. formal your peers are the people who are the same age as you, or who have the same type of job, social class etc同伴
--------------------
be passionate about sth.: 对某事充满热情
** ch.
1-1 慕课概述

欢迎来到由悉尼大学大脑与心智中心教育部创建的积极精神病学在线课程。
我们是一支由三位精神科医生组成的团队，热衷于通过社区教育来赋权大众。
他们是路易丝·纳什副教授、洛约拉·麦克莱恩副教授，以及我本人。
我们汇集了澳大利亚众多精神病学、心理学和心理健康研究领域的顶尖专家，与大家分享他们的见解。
我们还将听取“经验专家”的声音——那些曾经历精神疾病并分享个人康复故事的人。

良好的心理健康意味着感觉良好并具备良好的功能。
而积极精神病学不仅关注解决问题，还强调如何培养心理韧性与优势。
本课程还将涵盖精神疾病的基本知识，以及保持心理健康和提升幸福感的实用策略。
课程共分为五个模块，每个模块的设计都适用于一周的学习。

在第一模块中，我们将认识蒂娜——一位有着亲身经历的康复专家，她将讲述自己的故事。
本模块将探讨积极心理健康、压力与韧性，以及从亚里士多德到当代幸福感相关研究的重要发现。

第二模块关注身心健康。
我们将学习身体健康与生活方式对心理健康的重要性，并探讨运动如何作为循证治疗方法来应对常见心理健康问题。
本模块还将介绍基础放松技巧、正念策略，以及性格优势与如何识别自己的优势。

第三模块涉及爱与工作，并引入“休息与娱乐”这两个互补概念。
我们将学习依恋理论、社会联系，以及澳大利亚原住民关于幸福的古老智慧。
此外，我们还将探讨贡献的价值，并帮助你思考工作是否对你有益。

第四模块将介绍主要的精神疾病类别，包括其症状、成因和治疗方法。
涵盖内容包括焦虑、抑郁、成瘾等常见疾病，以及精神病、精神分裂症和双相情感障碍等较少见的精神疾病。

第五模块是本课程的最后一部分，我们将探讨多种康复路径。
内容包括早期干预、个人康复理念、患者支持网络、艺术治疗，以及精神与宗教实践等。

在每个模块中，都将包含多场讲座及推荐阅读材料的链接。
同时，还会有自我评估问卷和实践作业，例如SMART 目标设定。
评估内容包括测验以及由同伴评分的简答题。

欢迎加入我们的五周学习旅程，一起探索心理健康的奥秘，
共同提升对这一基本生命要素的理解！
