English/PPMH/1-1 MOOC overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-07 Fri 11:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org2dd905e" class="outline-2">
<h2 id="org2dd905e">1&#x2013;1 MOOC overview</h2>
<div class="outline-text-2" id="text-org2dd905e">
<p class="verse">
Welcome to the Positive Psychiatry online course<br />
&#xa0;created by the Education Department at the Brain and Mind Center, University of Sydney.<br />
We are a team of three psychiatrists<br />
&#xa0;who are passionate about community education as a means of empowerment.<br />
That is Associate Professor Louise Nash, Associate Professor Loyola McLean, and myself.<br />
We have brought together a large number of Australia's leading experts<br />
&#xa0;&#xa0;from psychiatry, psychology, and mental health research,<br />
&#xa0;to share their ideas.<br />
We'll also hear from experts by experience - people<br />
&#xa0;who have lived with mental illness and share their stories of personal recovery.<br />
<br />
Good mental health is about feeling good and functioning well.<br />
And positive psychiatry is about building strength as well as fixing problems.<br />
The course will also cover the fundamentals of mental illness<br />
&#xa0;and practical strategies for staying strong and enhancing well-being.<br />
The course is organized into five modules, each designed to be covered in one week.<br />
<br />
In the first module, we meet Tina,<br />
&#xa0;a lived experience and recovery expert who tells the first part of her story.<br />
This module will cover positive mental health, stress, and resilience,<br />
&#xa0;and some of the important findings from Aristotle<br />
&#xa0;&#xa0;through to recent research on the correlates of happiness.<br />
<br />
The second module is about the body and mind.<br />
We will learn about the central importance of physical health and lifestyle,<br />
&#xa0;and how exercise can be used as an evidence-based treatment for common mental health conditions.<br />
We will cover basic relaxation and mindfulness strategies,<br />
&#xa0;as well as personality strengths and how to identify your own strengths.<br />
<br />
In the third module we talk about love and work,<br />
&#xa0;and introduce the complementary ideas of rest and play.<br />
We will hear about attachment theory, social connections,<br />
&#xa0;and the ancient wisdom of Australian Aboriginal views on well-being.<br />
We discuss the importance of contributing,<br />
&#xa0;and here you will find out whether or not work is good for you.<br />
<br />
In the fourth module, we cover the major categories of mental illness;<br />
&#xa0;their symptoms, causes, and treatments.<br />
This includes the more common conditions such as anxiety, depression, and addictions,<br />
&#xa0;as well as less common mental illness such as psychosis, schizophrenia, and bipolar disorder.<br />
<br />
Our fifth and final module in this course will detail some of the many paths to recovery.<br />
From early intervention through the philosophy of personal recovery, consumer support networks,<br />
&#xa0;creative arts as therapy, as well as spiritual and religious practices.<br />
<br />
Within each module there will be many lectures and links to recommended readings.<br />
There will be self-assessment questionnaires<br />
&#xa0;and practical homework tasks including SMART goal setting.<br />
Assessments include quizzes and peer marked short answer questions.<br />
<br />
So join us for the next five weeks on a shared journey of learning towards better mental health<br />
&#xa0;and better understanding of this fundamental aspect of our well-being.<br />
</p>
</div>
<div id="outline-container-org3597f6a" class="outline-3">
<h3 id="org3597f6a">expression</h3>
<div class="outline-text-3" id="text-org3597f6a">
<p>
psychiatry [sɪˈkaɪətri] psychiatrist: n.n.the study and treatment of mental illnesses ⇨ psychology精神病学<br />
brain [breɪn]: n. the organ inside your head that controls how you think, feel, and move脑<br />
associate [əˈsoʊʃiət]: n. someone who you work or do business with SYN colleague合作人<br />
strength [streŋθ]: n. the physical power and energy that makes someone strong OPP weakness优势<br />
lifestyle [ˈlaɪfˌstaɪl]: n. the way a person or group of people live, including the place they live in, the things they own, the kind of job they do, and the activities they enjoy生活方式<br />
mindfulness : n. 正念<br />
complementary [ˌkɑmpləˈment(ə)ri]: adj. complementary things go well together, although they are usually different补充的, 补足的<br />
category [ˈkætəɡəri]: n. a group of people or things that are all of the same type种类<br />
anxiety [æŋˈzaɪəti]: n. the feeling of being very worried about something SYN concern焦虑<br />
depression [dɪˈpreʃ(ə)n]: n. a medical condition that makes you very unhappy and anxious and often prevents you from living a normal life抑郁<br />
psychosis [saɪˈkoʊsɪs]: n. a serious mental illness that can change your character and make you unable to behave in a normal way ⇨ psychotic精神错乱<br />
schizophrenia [ˌskɪtsəˈfriniə]: n. a serious mental illness in which someone’s thoughts and feelings are not based on what is really happening around them[心]精神分裂症<br />
bipolar [ˌbaɪˈpoʊlər]: adj. bipolar disorder technical ↑manic depression狂躁的<br />
intervention [ˌɪntərˈvenʃ(ə)n]: n. the act of becoming involved in an argument, fight, or other difficult situation in order to change what happens干涉<br />
quiz [kwɪz]: n. a competition or game in which people have to answer questions测验<br />
peer [pɪr]: n. formal your peers are the people who are the same age as you, or who have the same type of job, social class etc同伴<br />
</p>
<hr />
<p>
be passionate about sth.: 对某事充满热情<br />
</p>
</div>
</div>
<div id="outline-container-org973b291" class="outline-3">
<h3 id="org973b291">ch.</h3>
<div class="outline-text-3" id="text-org973b291">
<p>
1-1 慕课概述<br />
</p>

<p>
欢迎来到由悉尼大学大脑与心智中心教育部创建的积极精神病学在线课程。<br />
我们是一支由三位精神科医生组成的团队，热衷于通过社区教育来赋权大众。<br />
他们是路易丝·纳什副教授、洛约拉·麦克莱恩副教授，以及我本人。<br />
我们汇集了澳大利亚众多精神病学、心理学和心理健康研究领域的顶尖专家，与大家分享他们的见解。<br />
我们还将听取“经验专家”的声音——那些曾经历精神疾病并分享个人康复故事的人。<br />
</p>

<p>
良好的心理健康意味着感觉良好并具备良好的功能。<br />
而积极精神病学不仅关注解决问题，还强调如何培养心理韧性与优势。<br />
本课程还将涵盖精神疾病的基本知识，以及保持心理健康和提升幸福感的实用策略。<br />
课程共分为五个模块，每个模块的设计都适用于一周的学习。<br />
</p>

<p>
在第一模块中，我们将认识蒂娜——一位有着亲身经历的康复专家，她将讲述自己的故事。<br />
本模块将探讨积极心理健康、压力与韧性，以及从亚里士多德到当代幸福感相关研究的重要发现。<br />
</p>

<p>
第二模块关注身心健康。<br />
我们将学习身体健康与生活方式对心理健康的重要性，并探讨运动如何作为循证治疗方法来应对常见心理健康问题。<br />
本模块还将介绍基础放松技巧、正念策略，以及性格优势与如何识别自己的优势。<br />
</p>

<p>
第三模块涉及爱与工作，并引入“休息与娱乐”这两个互补概念。<br />
我们将学习依恋理论、社会联系，以及澳大利亚原住民关于幸福的古老智慧。<br />
此外，我们还将探讨贡献的价值，并帮助你思考工作是否对你有益。<br />
</p>

<p>
第四模块将介绍主要的精神疾病类别，包括其症状、成因和治疗方法。<br />
涵盖内容包括焦虑、抑郁、成瘾等常见疾病，以及精神病、精神分裂症和双相情感障碍等较少见的精神疾病。<br />
</p>

<p>
第五模块是本课程的最后一部分，我们将探讨多种康复路径。<br />
内容包括早期干预、个人康复理念、患者支持网络、艺术治疗，以及精神与宗教实践等。<br />
</p>

<p>
在每个模块中，都将包含多场讲座及推荐阅读材料的链接。<br />
同时，还会有自我评估问卷和实践作业，例如SMART 目标设定。<br />
评估内容包括测验以及由同伴评分的简答题。<br />
</p>

<p>
欢迎加入我们的五周学习旅程，一起探索心理健康的奥秘，<br />
共同提升对这一基本生命要素的理解！<br />
</p>
</div>
</div>
