other/PPMH/1-1 MOOC overview.org
** sentence
psychiatry [sɪˈkaɪətri] psychiatrist: n.n.the study and treatment of mental illnesses ⇨ psychology精神病学
- I am looking for a sophicated psychiatrist who can treat my father. 
- My grandmother living a long life in a village attributes my father's psychiatry to his disrespect to the god.
- Due to my father's psychiatry, my mother got divorced with him and left me since I was 3 years old.
brain [breɪn]: n. the organ inside your head that controls how you think, feel, and move脑
- The scientist is underway to research humanity brains.
- The scientist is trying to carry the monkey's brain far away from the village.
- It is believed that somewhere raw monkey's brains are regarded as delicacy.
associate [əˈsoʊʃiət]: n. someone who you work or do business with SYN colleague合作人
- Due to his brother's death, he is unwilling to be an associate of the corporation.
- Imagine being an associate of the famous corporation and working with these beautiful girls.
- What the associate have done in the court inspired awe in every attorneys in this corporation. 
strength [streŋθ]: n. the physical power and energy that makes someone strong OPP weakness优势
- Hordes of children have found their strengths in our workshops.
- You have forgot about the only strenth of a singer mother.
- Listen up, the associate is talking about your strengths and weaknesses.
lifestyle [ˈlaɪfˌstaɪl]: n. the way a person or group of people live, including the place they live in, the things they own, the kind of job they do, and the activities they enjoy生活方式
- After he was in the Hall of Fame basketball player, his lifestyle eventually have been changed.
- At the some point, the boxer who was adored by poor and rich alike had changed his lifestyle totally.
- In theory, you don't need to change your lifestyle after your retirement.
mindfulness : n. 正念
- Obviously, he has got to a mindfulness state.
- The ancient sport turns into an effective mindfulness exercise.
- The religious mindfulness exercise, thousands of years in the making, survives intact.
complementary [ˌkɑmpləˈment(ə)ri]: adj. complementary things go well together, although they are usually different补充的, 补足的
- The snacks are complementary and rice still remains the domain of your food.
- The mob is hanging around looking for some complementary money in the street.
- The complementary energy has slowed down the deterioration of the station.
category [ˈkætəɡəri]: n. a group of people or things that are all of the same type种类
- There are five categories of fruits decaying away in the warehouse.
- The associate will give you more time to deal with categories of cases.
- You are lucky enough to touch categories of cases in the first year of your job.
anxiety [æŋˈzaɪəti]: n. the feeling of being very worried about something SYN concern焦虑
- What's your next move for your anxiety inspired by your enemies?
- Saturated with anxiety, I am not able to fall asleep at night.
- Bit by bit anxiety is destorying the eminent lawyer.
depression [dɪˈpreʃ(ə)n]: n. a medical condition that makes you very unhappy and anxious and often prevents you from living a normal life抑郁
- The stuff precipitated out of these waters can treat depression. 
- I hope you treat your depression not in a pathological way.
- The psychiatrist created a perfect cast of this category of depression.
psychosis [saɪˈkoʊsɪs]: n. a serious mental illness that can change your character and make you unable to behave in a normal way ⇨ psychotic精神错乱
- You're not in the clear yet because your father is with psychosis.
- The patient with psychosis claimed to be seeing a mountain range.
- Any patient with psychosis will receive a warm welcome in the long-term care facility.
schizophrenia [ˌskɪtsəˈfriniə]: n. a serious mental illness in which someone’s thoughts and feelings are not based on what is really happening around them[心]精神分裂症
- His father with schizophrenia is scouting for enemies.
- The patient with schizophrenia hopes for a man who agrees with him.
- The patient with schizophrenia is trying to whack away the stone wall.
bipolar [ˌbaɪˈpoʊlər]: adj. bipolar disorder technical ↑manic depression狂躁的
- He has been diagnosed with bipolar disorder.
- We found the patient with bipolar disorder lying on a creek bank.
- The patient with bipolar disorder extracted the candy from the box.
intervention [ˌɪntərˈvenʃ(ə)n]: n. the act of becoming involved in an argument, fight, or other difficult situation in order to change what happens干涉
- Your husband's intervention in this case made it more difficult for us to exile the criminal.
- Your intervention makes me not able to concentrate on the game.
- The spokesman is accusing USA of intervention in other country's internal affairs.
quiz [kwɪz]: n. a competition or game in which people have to answer questions测验
- The quiz is full of dense and boring questions.
- An estimated 5 percent of students in our class can pass the quiz.
- The quiz is used to test your reading skills.
peer [pɪr]: n. formal your peers are the people who are the same age as you, or who have the same type of job, social class etc同伴
- Your peer is telling us funny stories at the party.
- It was embarrassing that your peer behaved so rude in the wedding.
- I am looking for my peer who was just telling pirate stories to you guys.
--------------------
be passionate about sth.: 对某事充满热情
- I am passionate about taking care of my cat beyond doubt.
- He is passionate about making surprises for his beautiful girlfriend.
- The programmer is so passionate about whoring that he has been called by police.
