English/PPMH/1-1 MOOC overview.html
<div id="outline-container-orga69fc2c" class="outline-3">
<h3 id="orga69fc2c">sentence2</h3>
<div class="outline-text-3" id="text-orga69fc2c">
<p>
psychiatry [sɪˈkaɪətri] psychiatrist: n.n.the study and treatment of mental illnesses ⇨ psychology精神病学<br />
</p>
<ul class="org-ul">
<li>I am looking for a sophisticated psychiatrist who can treat my father.<br /></li>
<li>My grandmother living a long life in a village attributes my father's psychiatry to his disrespect to the god.<br /></li>
<li>Due to my father's psychiatry my mother divorced him and left me when I was 3 years old.<br /></li>
</ul>
<p>
brain [breɪn]: n. the organ inside your head that controls how you think, feel, and move脑<br />
</p>
<ul class="org-ul">
<li>The scientist is underway to research humanity's brains.<br /></li>
<li>The scientist is trying to carry the monkey's brain far away from the village.<br /></li>
<li>It is believed that somewhere raw monkey brains are regarded as a delicacy.<br /></li>
</ul>
<p>
associate [əˈsoʊʃiət]: n. someone who you work or do business with SYN colleague合作人<br />
</p>
<ul class="org-ul">
<li>Due to his brother's death, he is unwilling to be an associate of the corporation.<br /></li>
<li>Imagine being an associate of a famous corporation and working with these beautiful girls.<br /></li>
<li>What the associate has done in the court inspired awe in every attorney in this corporation.<br /></li>
</ul>
<p>
strength [streŋθ]: n. the physical power and energy that makes someone strong OPP weakness优势<br />
</p>
<ul class="org-ul">
<li>Hordes of children have found their strengths in our workshops.<br /></li>
<li>You have forgotten about the only strength of a singer mother.<br /></li>
<li>Listen up, the associate is talking about your strengths and weaknesses.<br /></li>
</ul>
<p>
lifestyle [ˈlaɪfˌstaɪl]: n. the way a person or group of people live, including the place they live in, the things they own, the kind of job they do, and the activities they enjoy生活方式<br />
</p>
<ul class="org-ul">
<li>After he was in the Hall of Basketball Players Fame, his lifestyle eventually has been changed.<br /></li>
<li>At some point, the boxer who was adored by poor and rich alike had changed his lifestyle totally.<br /></li>
<li>In theory, you don't need to change your lifestyle after your retirement.<br /></li>
</ul>
<p>
mindfulness: n. 正念<br />
</p>
<ul class="org-ul">
<li>Obviously, he has got to a mindfulness state.<br /></li>
<li>The ancient sport turns into an effective mindfulness exercise.<br /></li>
<li>The religious mindfulness exercise, thousands of years in the making, survives intact.<br /></li>
</ul>
<p>
complementary [ˌkɑmpləˈment(ə)ri]: adj. complementary things go well together, although they are usually different补充的, 补足的<br />
</p>
<ul class="org-ul">
<li>The snacks are complementary and rice still remains the domain of your food.<br /></li>
<li>The mob is hanging around looking for some complementary money in the street.<br /></li>
<li>The complementary energy has slowed down the deterioration of the station.<br /></li>
</ul>
<p>
category [ˈkætəɡəri]: n. a group of people or things that are all of the same type种类<br />
</p>
<ul class="org-ul">
<li>There are five categories of fruits decaying away in the warehouse.<br /></li>
<li>The associate will give you more time to deal with categories of cases.<br /></li>
<li>You are lucky enough to touch categories of cases in the first year of your job.<br /></li>
</ul>
<p>
anxiety [æŋˈzaɪəti]: n. the feeling of being very worried about something SYN concern焦虑<br />
</p>
<ul class="org-ul">
<li>What's your next move for your anxiety inspired by your enemies?<br /></li>
<li>Saturated with anxiety, I am not able to fall asleep at night.<br /></li>
<li>Bit by bit anxiety is destroying the eminent lawyer.<br /></li>
</ul>
<p>
depression [dɪˈpreʃ(ə)n]: n. a medical condition that makes you very unhappy and anxious and often prevents you from living a normal life抑郁<br />
</p>
<ul class="org-ul">
<li>The stuff precipitated out of these waters can treat depression.<br /></li>
<li>I hope you treat your depression not in a pathological way.<br /></li>
<li>The psychiatrist created a perfect cast of this category of depression.<br /></li>
</ul>
<p>
psychosis [saɪˈkoʊsɪs]: n. a serious mental illness that can change your character and make you unable to behave in a normal way ⇨ psychotic精神错乱<br />
</p>
<ul class="org-ul">
<li>You're not in the clear yet because your father is with psychosis.<br /></li>
<li>The patient with psychosis claimed to be seeing a mountain range.<br /></li>
<li>Any patient with psychosis will receive a warm welcome in the long-term care facility.<br /></li>
</ul>
<p>
schizophrenia [ˌskɪtsəˈfriniə]: n. a serious mental illness in which someone’s thoughts and feelings are not based on what is really happening around them[心]精神分裂症<br />
</p>
<ul class="org-ul">
<li>His father with schizophrenia is scouting for enemies.<br /></li>
<li>The patient with schizophrenia hopes for a man who agrees with him.<br /></li>
<li>The patient with schizophrenia is trying to whack away the stone wall.<br /></li>
</ul>
<p>
bipolar [ˌbaɪˈpoʊlər]: adj. bipolar disorder technical ↑manic depression狂躁的<br />
</p>
<ul class="org-ul">
<li>He has been diagnosed with bipolar disorder.<br /></li>
<li>We found the patient with bipolar disorder lying on a creek bank.<br /></li>
<li>The patient with bipolar disorder extracted the candy from the box.<br /></li>
</ul>
<p>
intervention [ˌɪntərˈvenʃ(ə)n]: n. the act of becoming involved in an argument, fight, or other difficult situation in order to change what happens干涉<br />
</p>
<ul class="org-ul">
<li>Your husband's intervention in this case made it more difficult for us to exile the criminal.<br /></li>
<li>Your intervention makes me not able to concentrate on the game.<br /></li>
<li>The spokesman is accusing the USA of intervening in other country's internal affairs.<br /></li>
</ul>
<p>
quiz [kwɪz]: n. a competition or game in which people have to answer questions测验<br />
</p>
<ul class="org-ul">
<li>The quiz is full of dense and boring questions.<br /></li>
<li>An estimated 5 percent of students in our class can pass the quiz.<br /></li>
<li>The quiz is used to test your reading skills.<br /></li>
</ul>
<p>
peer [pɪr]: n. formal your peers are the people who are the same age as you, or who have the same type of job, social class etc同伴<br />
</p>
<ul class="org-ul">
<li>Your peer is telling us funny stories at the party.<br /></li>
<li>It was so embarrassing that your peer behaved rudely at the wedding.<br /></li>
<li>I am looking for my peer who was just then telling pirate stories to you guys.<br /></li>
</ul>
<hr />
<p>
be passionate about sth.: 对某事充满热情<br />
</p>
<ul class="org-ul">
<li>I am passionate about taking care of my cat beyond doubt.<br /></li>
<li>He is passionate about making surprises for his beautiful girlfriend.<br /></li>
<li>The programmer is so passionate about whoring that he has been called by police.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
